## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 14 to add, 33 to change, 12 to destroy.</code></pre>

* Create
  * azurerm_eventhub.aria_active_topic[&#34;00-res&#34;]
  * azurerm_eventhub.aria_active_topic[&#34;01-res&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;00-res&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;01-res&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;00-res&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;01-res&#34;]
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;00-af-active-ccd&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-active-ccd&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_service_plan.example[&#34;00-af-active-ccd&#34;]
  * azurerm_service_plan.example[&#34;00-af-aplfpa&#34;]
  * azurerm_service_plan.example[&#34;00-af-aplfta&#34;]
  * azurerm_service_plan.example[&#34;00-af-apluta&#34;]
  * azurerm_service_plan.example[&#34;00-af-bails&#34;]
  * azurerm_service_plan.example[&#34;00-af-joh&#34;]
  * azurerm_service_plan.example[&#34;00-af-sbails&#34;]
  * azurerm_service_plan.example[&#34;01-af-active-ccd&#34;]
  * azurerm_service_plan.example[&#34;01-af-aplfpa&#34;]
  * azurerm_service_plan.example[&#34;01-af-aplfta&#34;]
  * azurerm_service_plan.example[&#34;01-af-apluta&#34;]
  * azurerm_service_plan.example[&#34;01-af-bails&#34;]
  * azurerm_service_plan.example[&#34;01-af-joh&#34;]
  * azurerm_service_plan.example[&#34;01-af-sbails&#34;]
  * azurerm_service_plan.example[&#34;01-af-td&#34;]
  * azurerm_storage_account.xcutting[&#34;00&#34;]
  * azurerm_storage_account.xcutting[&#34;01&#34;]
* Delete
  * azurerm_eventhub.aria_active_topic[&#34;00-ack&#34;]
  * azurerm_eventhub.aria_active_topic[&#34;01-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;00-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;01-ack&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;00-ack&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;01-ack&#34;]
* Replace
  * azurerm_eventhub.aria_active_topic[&#34;00-pub&#34;]
  * azurerm_eventhub.aria_active_topic[&#34;01-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;00-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;01-pub&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;00-pub&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;01-pub&#34;]




<details><summary>Change Result (Click me)</summary>

:warning: **The content is omitted as it is too long.** :warning:

```hcl

  # data.azurerm_storage_account_sas.xcutting["00"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # data.azurerm_storage_account_sas.xcutting["01"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # azurerm_eventhub.aria_active_topic["00-ack"] will be destroyed
  # (because key ["00-ack"] is not in for_each map)
  - resource "azurerm_eventhub" "aria_active_topic" {
      - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox/eventhubs/evh-active-ack-00-uks-dlrm-01" -> null
      - message_retention   = 7 -> null
      - name                = "evh-active-ack-00-uks-dlrm-01" -> null
      - namespace_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox" -> null
      - namespace_name      = "ingest00-integration-eventHubNamespace001-sbox" -> null
      - partition_count     = 8 -> null
      - partition_ids       = [
          - "0",
          - "1",
          - "2",
          - "3",
          - "4",
          - "5",
          - "6",
          - "7",
        ] -> null
      - resource_group_name = "ingest00-main-sbox" -> null
      - status              = "Active" -> null
    }

  # azurerm_eventhub.aria_active_topic["00-pub"] must be replaced
-/+ resource "azurerm_eventhub" "aria_active_topic" {
      ~ id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox/eventhubs/evh-active-pub-00-uks-dlrm-01" -> (known after apply)
      ~ name                = "evh-active-pub-00-uks-dlrm-01" -> "evh-active-pub-sbox-00-uks-dlrm-01" # forces replacement
      ~ namespace_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox" -> (known after apply)
      ~ partition_ids       = [
          - "0",
          - "1",
          - "2",
          - "3",
          - "4",
          - "5",
          - "6",
          - "7",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_active_topic["00-res"] will be created
  + resource "azurerm_eventhub" "aria_active_topic" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "evh-active-res-sbox-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 8
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_active_topic["01-ack"] will be destroyed
  # (because key ["01-ack"] is not in for_each map)
  - resource "azurerm_eventhub" "aria_active_topic" {
      - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.EventHub/namespaces/ingest01-integration-eventHubNamespace001-sbox/eventhubs/evh-active-ack-01-uks-dlrm-01" -> null
      - message_retention   = 7 -> null
      - name                = "evh-active-ack-01-uks-dlrm-01" -> null
      - namespace_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.EventHub/namespaces/ingest01-integration-eventHubNamespace001-sbox" -> null
      - namespace_name      = "ingest01-integration-eventHubNamespace001-sbox" -> null
      - partition_count     = 8 -> null
      - partition_ids       = [
          - "0",
          - "1",
          - "2",
          - "3",
          - "4",
          - "5",
          - "6",
          - "7",
        ] -> null
      - resource_group_name = "ingest01-main-sbox" -> null
      - status              = "Active" -> null
    }

  # azurerm_eventhub.aria_active_topic["01-pub"] must be replaced
-/+ resource "azurerm_eventhub" "aria_active_topic" {
      ~ id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.EventHub/namespaces/ingest01-integration-eventHubNamespace001-sbox/eventhubs/evh-active-pub-01-uks-dlrm-01" -> (known after apply)
      ~ name                = "evh-active-pub-01-uks-dlrm-01" -> "evh-active-pub-sbox-01-uks-dlrm-01" # forces replacement
      ~ namespace_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.EventHub/namespaces/ingest01-integration-eventHubNamespace001-sbox" -> (known after apply)
      ~ partition_ids       = [
          - "0",
          - "1",
          - "2",
          - "3",
          - "4",
          - "5",
          - "6",
          - "7",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_active_topic["01-res"] will be created
  + resource "azurerm_eventhub" "aria_active_topic" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "evh-active-res-sbox-01-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest01-integration-eventHubNamespace001-sbox"
      + partition_count     = 8
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest01-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["00-ack"] will be destroyed
  # (because key ["00-ack"] is not in for_each map)
  - resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      - eventhub_name                     = "evh-active-ack-00-uks-dlrm-01" -> null
      - id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox/eventhubs/evh-active-ack-00-uks-dlrm-01/authorizationRules/aria_manage_sas" -> null
      - listen                            = true -> null
      - manage                            = true -> null
      - name                              = "aria_manage_sas" -> null
      - namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_key                       = (sensitive value) -> null
      - resource_group_name               = "ingest00-main-sbox" -> null
      - secondary_connection_string       = (sensitive value) -> null
      - secondary_key                     = (sensitive value) -> null
      - send                              = true -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["00-pub"] must be replaced
-/+ resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      ~ eventhub_name                     = "evh-active-pub-00-uks-dlrm-01" -> "evh-active-pub-sbox-00-uks-dlrm-01" # forces replacement
      ~ id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox/eventhubs/evh-active-pub-00-uks-dlrm-01/authorizationRules/aria_manage_sas" -> (known after apply)
        name                              = "aria_manage_sas"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["00-res"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      + eventhub_name                     = "evh-active-res-sbox-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["01-ack"] will be destroyed
  # (because key ["01-ack"] is not in for_each map)
  - resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      - eventhub_name                     = "evh-active-ack-01-uks-dlrm-01" -> null
      - id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.EventHub/namespaces/ingest01-integration-eventHubNamespace001-sbox/eventhubs/evh-active-ack-01-uks-dlrm-01/authorizationRules/aria_manage_sas" -> null
      - listen                            = true -> null
      - manage                            = true -> null
      - name                              = "aria_manage_sas" -> null
      - namespace_name                    = "ingest01-integration-eventHubNamespace001-sbox" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_key                       = (sensitive value) -> null
      - resource_group_name               = "ingest01-main-sbox" -> null
      - secondary_connection_string       = (sensitive value) -> null
      - secondary_key                     = (sensitive value) -> null
      - send                              = true -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["01-pub"] must be replaced
-/+ resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      ~ eventhub_name                     = "evh-active-pub-01-uks-dlrm-01" -> "evh-active-pub-sbox-01-uks-dlrm-01" # forces replacement
      ~ id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.EventHub/namespaces/ingest01-integration-eventHubNamespace001-sbox/eventhubs/evh-active-pub-01-uks-dlrm-01/authorizationRules/aria_manage_sas" -> (known after apply)
        name                              = "aria_manage_sas"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["01-res"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      + eventhub_name                     = "evh-active-res-sbox-01-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest01-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest01-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_key_vault_secret.eventhub_active_topic_secrets["00-ack"] will be destroyed
  # (because key ["00-ack"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "eventhub_active_topic_secrets" {
      - id                      = "https://ingest00-meta002-sbox.vault.azure.net/secrets/evh-active-ack-00-uks-dlrm-01-key/4f412c5ea3634dbfaeb55aa78ada80b1" -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - name                    = "evh-active-ack-00-uks-dlrm-01-key" -> null
      - resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/evh-active-ack-00-uks-dlrm-01-key/versions/4f412c5ea3634dbfaeb55aa78ada80b1" -> null
      - resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/evh-active-ack-00-uks-dlrm-01-key" -> null
      - tags                    = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - value                   = (sensitive value) -> null
      - value_wo                = (write-only attribute) -> null
      - value_wo_version        = 0 -> null
      - version                 = "4f412c5ea3634dbfaeb55aa78ada80b1" -> null
      - versionless_id          = "https://ingest00-meta002-sbox.vault.azure.net/secrets/evh-active-ack-00-uks-dlrm-01-key" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.eventhub_active_topic_secrets["00-pub"] must be replaced
-/+ resource "azurerm_key_vault_secret" "eventhub_active_topic_secrets" {
      ~ id                      = "https://ingest00-meta002-sbox.vault.azure.net/secrets/evh-active-pub-00-uks-dlrm-01-key/67713c03c3744dba8f2fd9542d2ce3ca" -> (known after apply)
      ~ name                    = "evh-active-pub-00-uks-dlrm-01-key" -> "evh-active-pub-sbox-00-uks-dlrm-01-key" # forces replacement
      ~ resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/evh-active-pub-00-uks-dlrm-01-key/versions/67713c03c3744dba8f2fd9542d2ce3ca" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/evh-active-pub-00-uks-dlrm-01-key" -> (known after apply)
        tags                    = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ value                   = (sensitive value)
      - value_wo_version        = 0 -> null
      ~ version                 = "67713c03c3744dba8f2fd9542d2ce3ca" -> (known after apply)
      ~ versionless_id          = "https://ingest00-meta002-sbox.vault.azure.net/secrets/evh-active-pub-00-uks-dlrm-01-key" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.eventhub_active_topic_secrets["00-res"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_active_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + name                    = "evh-active-res-sbox-00-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_active_topic_secrets["01-ack"] will be destroyed
  # (because key ["01-ack"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "eventhub_active_topic_secrets" {
      - id                      = "https://ingest01-meta002-sbox.vault.azure.net/secrets/evh-active-ack-01-uks-dlrm-01-key/eeb9d6f856c04cf1b87ed3774e2a665d" -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox" -> null
      - name                    = "evh-active-ack-01-uks-dlrm-01-key" -> null
      - resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

         = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox01-uks-dlrm-01"
        name                                           = "af-joh-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox01-uks-dlrm-01"
        name                                           = "af-sbails-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-td-sbox01-uks-dlrm-01"
        name                                           = "af-td-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_service_plan.example["00-af-active-ccd"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-active-ccd-sbox00-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-active-ccd-sbox00-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["00-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfpa-sbox00-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-aplfpa-sbox00-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["00-af-aplfta"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfta-sbox00-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-aplfta-sbox00-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["00-af-apluta"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-apluta-sbox00-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-apluta-sbox00-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["00-af-bails"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-bails-sbox00-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-bails-sbox00-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["00-af-joh"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-joh-sbox00-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-joh-sbox00-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["00-af-sbails"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-sbails-sbox00-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-sbails-sbox00-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["01-af-active-ccd"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/serverFarms/af-active-ccd-sbox01-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-active-ccd-sbox01-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["01-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfpa-sbox01-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-aplfpa-sbox01-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["01-af-aplfta"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfta-sbox01-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-aplfta-sbox01-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["01-af-apluta"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/serverFarms/af-apluta-sbox01-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-apluta-sbox01-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["01-af-bails"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/serverFarms/af-bails-sbox01-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-bails-sbox01-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["01-af-joh"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/serverFarms/af-joh-sbox01-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-joh-sbox01-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["01-af-sbails"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/serverFarms/af-sbails-sbox01-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-sbails-sbox01-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["01-af-td"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/serverFarms/af-td-sbox01-uks-dlrm-01"
      ~ maximum_elastic_worker_count    = 1 -> 50
        name                            = "af-td-sbox01-uks-dlrm-01"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_storage_account.xcutting["00"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00xcuttingsbox"
        name                               = "ingest00xcuttingsbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.xcutting["01"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest01xcuttingsbox"
        name                               = "ingest01xcuttingsbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

Plan: 14 to add, 33 to change, 12 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":199,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->